Revit 2024 API
ViewPlan.CreateAreaPlan Method
 Creates a new area plan ViewPlan.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static ViewPlan CreateAreaPlan(
	Document document,
	ElementId areaSchemeId,
	ElementId levelId
)
Visual Basic
Public Shared Function CreateAreaPlan ( _
	document As Document, _
	areaSchemeId As ElementId, _
	levelId As ElementId _
) As ViewPlan
Visual C++
public:
static ViewPlan^ CreateAreaPlan(
	Document^ document,
	ElementId^ areaSchemeId,
	ElementId^ levelId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document to which the area plan will be added.
areaSchemeId
Type: Autodesk.Revit.DB.ElementId
 The id of the AreaScheme which will be used by the area plan.
levelId
Type: Autodesk.Revit.DB.ElementId
 The id of the Level to associate with the area plan.
Return Value
 The new area plan ViewPlan.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The AreaScheme id is not valid and cannot be used for area plan views. -or- The ElementId levelId does not correspond to a Level. -or- Plan view creation is not allowed in this family.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ViewPlan Class
Autodesk.Revit.DB Namespace